[{"oid":"120","author":"A. Bouguettaya, Q. Z. Sheng and F. Daniel (Eds.)","title":"Advanced Web Services","to_uploadresource":null,"abstract":"Web services and Service-Oriented Computing (SOC) have become thriving areas of academic research, joint university\/industry research projects, and novel IT products on the market. SOC is the computing paradigm that uses Web services as building blocks for the engineering of composite, distributed applications out of the reusable application logic encapsulated by Web services. Web services could be considered the best-known and most standardized technology in use today for distributed computing over the Internet.\r\n<\/br>\r\nThis book is the second installment of a two-book collection covering the state-of-the-art of both theoretical and practical aspects of Web services and SOC research and deployments. Advanced Web Services specifically focuses on advanced topics of Web services and SOC and covers topics including Web services transactions, security and trust, Web service management, real-world case studies, and novel perspectives and future directions.\r\n<\/br>\r\nThe editors present foundational topics in the first book of the collection, Web Services Foundations (Springer, 2013). Together, both books comprise approximately 1400 pages and are the result of an enormous community effort that involved more than 100 authors, comprising the world’s leading experts in this field.","where":"Springer, 2014. In print. ISBN 978-1-4614-7534-7"},{"oid":"129","author":"F. Daniel, G. Papadopoulos, P. Thiran (Eds.)","title":"Mobile Web Information Systems. 10th International Conference, MobiWIS 2013, Paphos, Cyprus, August 26-29, 2013, Proceedings","to_uploadresource":null,"abstract":"This book constitutes the refereed proceedings of the 10 th International Conference on Mobile Web Information Systems, MobiWIS 2013, held in Paphos, Cyprus, in August 2013. The 25 papers (20 full research papers, 4 demonstration papers, and one abstract of the keynote speech) presented were carefully reviewed and selected from various submissions. The papers cover the following topics related to mobile Web and Information Systems (WISs), such as mobile Web services, location-awareness, design and development, social computing and society, development infrastructures and services, SOA and trust, UI migration and human factors, and Web of Things and networks.","where":"Springer, August 2013. ISBN 978-3-642-40275-3"},{"oid":"119","author":"A. Bouguettaya, Q. Z. Sheng and F. Daniel (Eds.)","title":"Web Services Foundations","to_uploadresource":null,"abstract":"Web services and Service-Oriented Computing (SOC) have become thriving areas of academic research, joint university\/industry research projects, and novel IT products on the market. SOC is the computing paradigm that uses Web services as building blocks for the engineering of composite, distributed applications out of the reusable application logic encapsulated by Web services. Web services could be considered the best-known and most standardized technology in use today for distributed computing over the Internet. \r\n<\/br>\r\nWeb Services Foundations is the first installment of a two-book collection covering the state-of-the-art of both theoretical and practical aspects of Web services and SOC research. This book specifically focuses on the foundations of Web services and SOC and covers - among others - Web service composition, non-functional aspects of Web services, Web service selection and recommendation, and assisted Web service composition. \r\n<\/br>\r\nThe editors collect advanced topics in the second book of the collection, Advanced Web Services, (Springer, 2013). Both books together comprise approximately 1400 pages and are the result of an enormous community effort that involved more than 100 authors, comprising the world’s leading experts in this field.","where":"Springer, 2014. In print. ISBN 978-1-4614-7517-0"},{"oid":"127","author":"F. Daniel, J. Wang and B.Weber (Eds.)","title":"Business Process Management. 11th International Conference, BPM 2013, Beijing, China, August 26-30, 2013, Proceedings","to_uploadresource":null,"abstract":"This book constitutes the proceedings of the 11th International Conference on Business Process Management, BPM 2013, held in Beijing, China, in August 2013. The 17 regular papers and 8 short papers included in this volume were carefully reviewed and selected from 118 submissions. The papers are organized in 7 topical sections named: process mining; conformance checking; process data; process model matching; process architectures and collaboration; as well as alternative perspectives, and industry paper.","where":"Springer, August 2013. ISBN 978-3-642-40175-6"},{"oid":"128","author":"P. Silveira, R. van de Langenberg, E. van het Reve, F. Daniel, F. Casati, E.D. de Bruin","title":"Tablet-Based Strength-Balance Training to Motivate and Improve Adherence to Exercise in Independently Living Older People: A Phase II Preclinical Exploratory Trial","abstract":"Background: Reaction time, coordination, and cognition performance typically diminish in older adults, which may lead to gait impairments, falls, and injuries. Regular strength–balance exercises are highly recommended to reduce this problem and to improve health, well-being, and independence in old age. However, many older people face a lack of motivation in addition to other strong barriers to exercise. We developed ActiveLifestyle, an information technology (IT)-based system for active and healthy aging aiming at improving balance and strength. ActiveLifestyle is a training app that runs on a tablet and assists, monitors, and motivates older people to follow personalized training plans autonomously at home.<\/br>\r\nObjectives: The objectives were to (1) investigate which IT-mediated motivation strategies increase adherence to physical exercise training plans in older people, (2) assess the impact of ActiveLifestyle on physical activity behavior change, and (3) demonstrate the effectiveness of the ActiveLifestyle training to improve gait speed.<\/br>\r\nMethods: 44 older adults followed personalized, 12-week strength and balance training plans. All participants performed the exercises autonomously at home. Questionnaires were used to assess the technological familiarity and stage of behavior change, as well as the effectiveness of the motivation instruments adopted by ActiveLifestyle. Adherence to the exercise plan was evaluated using performance data collected by the app and through information given by the participants during the study. Pretests and posttests were performed to evaluate gait speed of the participants before and after the study.<\/br>\r\nResults: Participants were 75 years (SD 6); predominantly females (64%), hold trades or professional diploma (54%), and their past profession was in a sitting position (43%). Of the 44 participants who enrolled, 33 (75%) completed the study. The app proved to assist and motivate independently living and healthy older adults to autonomously perform strength–balance exercises (median=6 on a 7-point Likert scale). Social motivation strategies proved more effective than individual strategies to stimulate the participants to comply with the training plan, as well as to change their behavior permanently toward a more physically active lifestyle. The exercises were effective to improve preferred and fast gait speed.<\/br>\r\nConclusions: ActiveLifestyle assisted and motivated independently living and healthy older people to autonomously perform strength–balance exercises over 12 weeks and had low dropout rates. The social motivation strategies were more effective to stimulate the participants to comply with the training plan and remain on the intervention. The adoption of assistive technology devices for physical intervention tends to motivate and retain older people exercising for longer periods of time.","to_uploadresource":"117","where":"Journal of Medical Internet Research, Volume 15, Number 8, 2013. URL http:\/\/www.jmir.org\/2013\/8\/e159\/ DOI:10.2196\/jmir.2579"},{"oid":"126","author":"F. Daniel and A. Furlan","title":"The Interactive API (iAPI)","to_uploadresource":"116","abstract":"The claim of this paper is that reuse on the Web – if sensibly facilitated – can be achieved in a much more intuitive and efficient fashion than today. The idea is to invert the current perspective on reuse by moving away from programmer-oriented artifacts, such as APIs, web services and data feeds, and focusing on user-oriented artifacts, i.e., graphical user interfaces (UIs). The paper defines a new kind of API, the interactive API (iAPI), which reconciles the intuitiveness of interactive UIs with the power of programmable APIs and enables (i) programmatic access to UIs and (ii) interactive, live programming. The paper discusses use cases and implementation options and lays the foundation for UI-oriented computing as a discipline.","href":"publicationdetails.php?publication_oid=126","where":"Proceedings of ComposableWeb 2013, LNCS 8295, July 2013, Pages 3-15. (to appear)"},{"oid":"125","author":"J. Jara, F. Daniel F. Casati and M. Marchese","title":"From a Simple Flow to Social Applications","to_uploadresource":"115","abstract":"Currently, there are a lot of people trying to leverage on the success of social networks by implementing social applications. However, implementing social applications is complex, due to the requirements and constraints put by the social networks to protect their data. In this work we present Simple Flow, a tool that simplifies the creation of social applications. Simple Flow proposes a processes-based approach to the design and execution of social applications. Simple Flow targets end-users and programmers with no experience in programming for social networks, giving them the possibility to design processes by concatenating social network actions (like post a message or comment a photo). For the execution of the designed processes Simple Flow interconnects, at runtime, template web pages (one page per action) according to the process design defined previously. These templates abstract the complexities of the interactions with social networks.","href":"publicationdetails.php?publication_oid=125","where":"Proceedings of ComposableWeb 2013, July 2013, Springer. (to appear)"},{"oid":"124","author":"F. Daniel, P. Dolog and Q. Li (Eds.)","title":"Web Engineering. 13th International Conference, ICWE 2013, Aalborg, Denmark, July 8-12, 2013, Proceedings","to_uploadresource":null,"abstract":"This book constitutes the refereed proceedings of the 13th International Conference on Web Engineering, ICWE 2013, held in Aalborg, Denmark, in July 2013. The 21 full research papers, 4 industry papers, and 11 short papers presented were carefully reviewed and selected from 92 submissions. The scientific program was completed with 7 workshops, 6 demonstrations and posters. The papers cover a wide spectrum of topics, such as, among others: web mining and knowledge extraction, semantic and linked data management, crawling and web research, model-driven web engineering, component-based web engineering, Rich Internet Applications (RIAs) and client-side programming, web services, and end-user development.","where":"Springer, June 2013. ISBN 978-3-642-39199-6."},{"oid":"122","author":"M. Castellano, F. Daniel, I. Garrigós and J.-N. Mazón","title":"Business Intelligence and the Web. Guest editors’ introduction","abstract":null,"to_uploadresource":"113","where":"Information Systems Frontiers, Volume 15, Number 3, 2013, Springer, Pages 307-309. Special issue editorial."},{"oid":"121","author":"S. Roy Chowdhury, O. Chudnovskyy, M. Niederhausen, S. Pietschmann, P. Sharples, F. Daniel and M. Gaedke","title":"Complementary Assistance Mechanisms for End User Mashup Composition","to_uploadresource":"112","abstract":"Despite several efforts for simplifying the composition process, learning efforts required for using existing mashup editors to develop mashups remain still high. In this paper, we describe how this barrier can be lowered by means of an assisted development approach that seamlessly integrates automatic composition and interactive pattern recommendation techniques into existing mashup platforms for supporting easy mashup development by end users. We showcase the use of such an assisted development environment in the context of an open-source mashup platform Apache Rave. Results of our user studies demonstrate the benefits of our approach for end user mashup development.","href":"publicationdetails.php?publication_oid=121","where":"WWW 2013 Demo, May 2013."},{"oid":"118","author":"P. Silveira, E. van het Reve, F. Daniel, F. Casati and E.D. de Bruin","title":"Motivating and Assisting Physical Exercise in Independently Living Older Adults: A Pilot Study","abstract":"With age reaction time, coordination and cognition tend to deteriorate, which may lead to gait impairments, falls and injuries. To reduce this problem in elderly and to improve health, well-being and independence, regular balance and strength exercises are recommended. However, elderly face strong barriers to exercise. We developed Active Lifestyle, an IT-based system for active and healthy ageing aiming at improving elderly’s balance and strength. Active Lifestyle is a proactive training application, running on a tablet, which assists, monitors and motivates elderly to follow personalized training plans autonomously at home, while integrating them socially. We ran a pilot study to investigate: i) the feasibility of assisting the autonomous, physical training of independently living elderly with the Active Lifestyle system, ii) the adherence of the participants to the training plans, and iii) the effectiveness of the motivation instruments built into the system. The study shows that the Active Lifestyle app prototype has valuable potential to support physical exercise practice at home and it is worthwhile to further develop it into a more mature system. Furthermore, the results add to the knowledge base into mobile-based applications for elderly, in that it shows that elderly users can learn to work with mobile-based systems. The Active Lifestyle app proved viable to support and motivate independently living elderly to autonomously perform balance and strength exercises. ","to_uploadresource":"111","where":"International Journal of Medial Informatics, Volume 82, Number 5, May 2013, Elsevier, Pages 325–334. DOI 10.1016\/j.ijmedinf.2012.11.015"},{"oid":"123","author":"F. Daniel, J. Eriksson, N. Finne, H. Fuchs, A. Gaglione, S. Karnouskos, P. M. Montero, L. Mottola, N. Oertel, F. J. Oppermann, G. P. Picco, K. Römer, P. Spieß, S. Tranquillini and T. Voigt","title":"makeSense: Real-world Business Processes through Wireless Sensor Networks","to_uploadresource":"114","abstract":"Wireless sensor networks (WSNs) have been a promising technology for quite some time. Their success stories are, however, restricted to environmental monitoring. In the industrial domain, their adoption has been hampered by two main factors. First, there is a lack of integration of WSNs with business process modeling languages and back-ends. Second, programming WSNs is still challenging as it is mainly performed at the operating system level. To this end, we provide the makeSense framework, a unified programming framework and a compilation chain that, from high-level business process specifications, generates code ready for deployment on WSN nodes. In this paper, we present the makeSense framework and the application scenario for our final deployment.","href":"publicationdetails.php?publication_oid=123","where":"CONET 2013, April 2013, Pages 58-72."},{"oid":"117","author":"C. Rodríguez, D. Schleicher, F. Daniel, F. Casati, F. Leymann and S. Wagner","title":"SOA-enabled compliance management: instrumenting, assessing, and analyzing service-based business processes","abstract":"Facilitating compliance management, that is, assisting a company’s management in conforming to laws, regulations, standards, contracts, and policies, is a hot but non-trivial task. The service-oriented architecture (SOA) has evolved traditional, manual business practices into modern, service-based IT practices that ease part of the problem: the systematic definition and execution of business processes. This, in turn, facilitates the online monitoring of system behaviors and the enforcement of allowed behaviors - all ingredients that can be used to assist compliance management on the fly during process execution. In this paper, instead of focusing on monitoring and runtime enforcement of rules or constraints, we strive for an alternative approach to com- pliance management in SOAs that aims at assessing and improving compliance. We propose two ingredients: (i) a model and tool to design compliant service-based processes and to instrument them in order to generate evidence of how they are executed and (ii) a reporting and analysis suite to create awareness of a company’s compliance state and to enable understanding why and where compliance violations have occurred. Together, these ingredients result in an approach that is close to how the real stakeholders - compliance experts and auditors - actually assess the state of compliance in practice and that is less intrusive than enforcing compliance.","to_uploadresource":"110","where":"Service-Oriented Computing and Applications (SOCA), 2013, Springer. In print. DOI 10.1007\/s11761-013-0129-3"},{"oid":"114","author":"F. Daniel, M. Imran, S. Soi, A. De Angeli, C. R. Wilkinson, F. Casati and M. Marchese","title":"Developing Mashup Tools for End-Users: On the Importance of the Application Domain","abstract":"The recent emergence of mashup tools has refueled research on end-user development, i.e., on enabling end-users without programming skills to compose their own applications. Yet, similar to what happened with analogous promises in web service composition and business process management, research has mostly focused on technology and, as a consequence, has failed its objective. Plain technology (e.g., SOAP\/WSDL web services) or simple modeling languages (e.g., Yahoo! Pipes) don’t convey enough meaning to non-programmers.\r\nIn this article, we propose a domain-specific approach to mashups that 'speaks the language of the user', i.e., that is aware of the terminology, concepts, rules, and conventions (the domain) the user is comfortable with. We show what developing a domain-specific mashup tool means, which role the mashup meta-model and the domain model play and how these can be merged into a domain-specific mashup meta-model. We exemplify the approach by implementing a mashup tool for a specific scenario (research evaluation) and describe the respective user study. The results of a first user study confirm that domain-specific mashup tools indeed lower the entry barrier to mashup development.","to_uploadresource":"107","where":"International Journal of Next-Generation Computing (IJNGC), Volume 3, Number 2, July 2012, Perpetual Innovation."},{"oid":"112","author":"S. Tranquillini, P. Spieß, F. Daniel, S. Karnouskos, F. Casati, N. Oertel, L. Mottola, F. J. Oppermann, G. P. Picco, K. Römer and T. Voigt","title":"Process-Based Design and Integration of Wireless Sensor Network Applications","to_uploadresource":"106","abstract":"Wireless Sensor and Actuator Networks (WSNs) are distributed sensor and actuator networks that monitor and control real-world phenomena, enabling the integration of the physical with the virtual world. They are used in domains like building automation, control systems, remote healthcare, etc., which are all highly process-driven. Today, tools and insights of Business Process Modeling (BPM) are not used to model WSN logic, as BPM focuses mostly on the coordination of people and IT systems and neglects the integration of embedded IT. WSN development still requires significant special-purpose, low-level, and manual coding of process logic. By exploiting similarities between WSN applications and business processes, this work aims to create a holistic system enabling the modeling and execution of executable processes that integrate, coordinate, and control WSNs. Concretely, we present a WSN-specific extension for Business Process Modeling Notation (BPMN) and a compiler that transforms the extended BPMN models into WSN-specific code to distribute process execution over both a WSN and a standard business process engine. The developed tool-chain allows modeling of an independent control loop for the WSN.","href":"publicationdetails.php?publication_oid=112","where":"BPM 2012, September 2012, Springer, Pages 134-149."},{"oid":"111","author":"C. Rodriguez, R. Engel, G. Kostoska, F. Daniel, F. Casati and M. Aimar","title":"Eventifier: Extracting Process Execution Logs from Operational Databases","to_uploadresource":"105","abstract":"This demo introduces Eventifier, a tool that helps in reconstructing an event log from operational databases upon which process instances have been executed. The purpose of reconstructing such event log is that of discovering process models out of it, and, hence, the tool targets researches and practitioners interested in process mining. The aim of this demo is to convey to the participants both the conceptual and practical implications of identifying and extracting process execution events from such databases for reconstructing ready-to-use event logs for process discovery.","href":"publicationdetails.php?publication_oid=111","where":"BPM 2012 Demos, September 2012."},{"oid":"109","author":"C. Cappiello, M. Matera, M. Picozzi, F. Daniel and A. Fernandez","title":"Quality-Aware Mashup Composition: Issues, Techniques and Tools","to_uploadresource":"103","abstract":"Web mashups are a new generation of applications based on the composition of ready-to-use, heterogeneous components. In different contexts, ranging from the consumer Web to Enterprise systems, the potential of this new technology is to make users evolve from passive receivers of applications to actors actively involved in the creation of their artifacts, thus accommodating the inherent variability of the users' needs. Current advances in mashup technologies are good candidates to satisfy this requirement. However, some issues are still largely unexplored. In particular, quality issues specific for this class of applications, and the way they can guide the users in the identification of adequate components and composition patterns, are neglected. This paper discusses quality dimensions that can capture the intrinsic quality of mashup components, as well as the components' capacity to maximize the quality and the user-perceived value of the overall composition. It also proposes an assisted composition process in which quality becomes the driver for recommending to the users how to complete mashups, based on the integration of quality assessment and recommendation techniques within a tool for mashup development.","href":"publicationdetails.php?publication_oid=109","where":"QUATIC 2012, September 2012, Pages 10 - 19."},{"oid":"110","author":"P.Kucherbaev, S. Tranquillini, F. Daniel, F. Casati, M. Marchese, M. Brambilla and P. Fraternali","title":"Business Processes for the Crowd Computer","to_uploadresource":"104","abstract":"Abstract. Social networks and crowdsourcing platforms provide powerful means to execute tasks that require human intelligence instead of just machine computation power. Especially crowdsourcing has demonstrated its applicability in many fields, and a variety of platforms have been created for delegating small tasks to human solvers on the Web. However, creating applications that are structured, thus applications that combine more than a single task, is a complex and typically manual endeavor that requires many different interactions with crowdsourcing platforms. In this paper, we introduce the idea of a crowd computer, discuss its properties, and propose a programming paradigm for the development of crowdsourcing applications. In particular, we argue in favor of business processes as formalism to program the crowd computer and show how they enable the reuse of intricate crowdsourcing practices.","href":"publicationdetails.php?publication_oid=110","where":"BPMS2 Workshop, September 2012, Springer."},{"oid":"115","author":"J.-N. Mazón, I. Garrigós, F. Daniel and M. Castellanos","title":"Report of the International Workshop on Business Intelligence and the Web – BEWEB 2011","abstract":"The 2nd International Workshop on Business intelligencE and the WEB (BEWEB) was co-located with the EDBT\/ICDT 2011 Joint Conference in Uppsala (Sweden)\r\non March 25, 2011. BEWEB intends to be an international forum for researchers and practitioners to exchange ideas on how to leverage the huge amount of data that is available on the Web in BI applications and on how to apply Web \r\nengineering methods and techniques to the design of BI applications. This report summarizes the 2011 edition of \r\nBEWEB.","to_uploadresource":"108","where":"SIGMOD Record, Volume 41, Number 3, September 2012, Pages 51-53."},{"oid":"106","author":"M. Imran, S. Soi, F. Kling, F. Daniel, F. Casati and M. Marchese","title":"On the Systematic Development of Domain-Specific Mashup Tools for End Users","to_uploadresource":"100","abstract":"The recent emergence of mashup tools has refueled research on end user development, i.e., on enabling end-users without programming skills to compose their own applications. Yet, similar to what happened with analogous promises in web service composition and business process management, research has mostly focused on technology and, as a consequence, has failed its objective. In this paper, we propose a domain- specific approach to mashups that is aware of the terminology, concepts, rules, and conventions (the domain) the user is comfortable with. We show what developing a domain-specific mashup tool means, which role the mashup meta-model and the domain model play and how these can be merged into a domain-specific mashup meta-model. We exemplify the approach by implementing a mashup tool for a specific domain (research evaluation) and describe the respective user study. The results of the user study confirm that domain-specific mashup tools indeed lower the entry barrier to mashup development.","href":"publicationdetails.php?publication_oid=106","where":"ICWE 2012, July 2012, Springer, Pages 291-298."},{"oid":"105","author":"F. Casati, F. Daniel, G. Dantchev, J. Eriksson, N. Finne, S. Karnouskos, P. M. Montero, L. Mottola, F. J. Oppermann, G. P. Picco, A. Quartulli, K. Römer, P. Spiess and S. Tranquillini","title":"Towards Business Processes Orchestrating the Physical Enterprise with Wireless Sensor Networks","to_uploadresource":"99","abstract":"The industrial adoption of wireless sensor networks (WSNs) is hampered by two main factors. First, there is a lack of integration of WSNs with business process modeling languages and back-ends. Second, programming WSNs is still challenging as it is mainly performed at the operating system level. To this end, we provide makeSense: a unified programming framework and a compilation chain that, from high-level business process specifications, generates code ready for deployment on WSN nodes.","href":"publicationdetails.php?publication_oid=105","where":"ICSE 2012, June 2012, Pages 1357-1360."},{"oid":"108","author":"F. Daniel and M. Younas","title":"Mobile Web and service applications: guest editors' introduction","abstract":null,"to_uploadresource":"102","where":"Service Oriented Computing and Applications, Volume 6, Number 4, December 2012, Springer, Pages 337-339. Special issue editorial."},{"oid":"107","author":"P. Silveira, F. Daniel, F. Casati, E. van het Reve and E. D. de Bruin","title":"ActiveLifestyle: an application to help elders stay physically and socially active","to_uploadresource":"101","abstract":"Age typically brings motor control impairments and loss of the lower body muscle strength, which can lead to falls, injuries and, in the worst case, death. It is well know that the practice of simple daily physical exercises can reduce the likelihood of falls, however, it is also known that it is far from easy to motivate elders to exercise, especially autonomously at home. To address this challenge, we have designed an app that not only makes it feasible and easier to follow a training plan for physical exercises, but that also introduces individual and social motivational instruments to increase the adherence to a plan – everything inside a virtual community composed of training partners, healthcare experts, and family members.","href":"publicationdetails.php?publication_oid=107","where":"FoSIBLE 2012, May 2012."},{"oid":"104","author":"H. Gebhardt, M. Gaedke, F. Daniel, S. Soi, F. Casati, C. A. Iglesias and S. Wilson","title":"From Mashups to Telco Mashups: A Survey","abstract":"Given their increasing popularity and novel requirements and characteristics, telco mashups deserve an analysis that goes beyond what's available for mashups in general. Here, the authors cluster telco services into different types, analyze their features, derive a telco mashup reference architecture, and survey how well existing mashup tools can respond to these mashups' novel needs.","to_uploadresource":"98","where":"Internet Computing, Volume 16, Number 3, 2012, IEEE Press, Pages 70-76."},{"oid":"102","author":"F. Daniel, C. Rodríguez, S. Roy Chowdhury, H. R. Motahari Nezhad and F. Casati","title":"Discovery and Reuse of Composition Knowledge for Assisted Mashup Development","to_uploadresource":"97","abstract":"Despite the emergence of mashup tools like Yahoo! Pipes or JackBe Presto Wires, developing mashups is still non-trivial and requires intimate knowledge about the functionality of web APIs and services, their interfaces, parameter settings, data mappings, and so on. We aim to assist the mashup process and to turn it into an interactive co-creation process, in which one part of the solution comes from the developer and the other part from reusable composition knowledge that has proven successful in the past. We harvest composition knowledge from a repository of existing mashup models by mining a set of reusable composition patterns, which we then use to interactively provide composition recommendations to developers while they model their own mashup. Upon acceptance of a recommendation, the purposeful design of the respective pattern types allows us to automatically weave the chosen pattern into a partial mashup model, in practice performing a set of modeling actions on behalf of the developer. The experimental evaluation of our prototype implementation demonstrates that it is indeed possible to harvest meaningful, reusable knowledge from existing mashups, and that even complex recommendations can be efficiently queried and weaved also inside the client browser.","href":"publicationdetails.php?publication_oid=102","where":"WWW 2012 Companion, April 2012, Pages 493-494. Poster."},{"oid":"101","author":"F. Daniel, M. Imran, F. Kling, S. Soi, F. Casati and M. Marchese","title":"Developing Domain-Specific Mashup Tools for End Users","to_uploadresource":"96","abstract":"The recent emergence of mashup tools has refueled research on end user development, i.e., on enabling end users without programming skills to compose own applications. Yet, similar to what happened with analogous promises in web service composition and business process management, research has mostly focused on technology and, as a consequence, has failed its objective. Plain technology (e.g., SOAP\/WSDL web services) or simple modeling languages (e.g., Yahoo! Pipes) don’t convey enough meaning to non-programmers.\r\n\r\nWe propose a domain-specific approach to mashups that “speaks the language of the user”, i.e., that is aware of the terminology, concepts, rules, and conventions (the domain) the user is comfortable with. We show what developing a domain-specific mashup tool means, which role the mashup meta-model and the domain model play and how these can be merged into a domain-specific mashup meta-model. We apply the approach implementing a mashup tool for the research evaluation domain. Our user study confirms that domain-specific mashup tools indeed lower the entry barrier\r\nto mashup development.","href":"publicationdetails.php?publication_oid=101","where":"WWW 2012 Companion, April 2012, Pages 491-492. Poster."},{"oid":"96","author":"M. Imran, F. Kling, S. Soi, F. Daniel, F. Casati and M. Marchese","title":"ResEval Mash: A Mashup Tool for Advanced Research Evaluation","to_uploadresource":"92","abstract":"In this demonstration, we present ResEval Mash, a mashup platform for research evaluation, i.e., for the assessment of the productivity or quality of researchers, teams, institutions, journals, and the like - a topic most of us are acquainted with. The platform is specifically tailored to the need of sourcing data about scientific publications and researchers from the Web, aggregating them, computing metrics (also complex and ad-hoc ones), and visualizing them.\r\nResEval Mash is a hosted mashup platform with a client-side editor and runtime engine, both running inside a common web browser. It supports the processing of also large amounts of data, a feature that is achieved via the sensible distribution of the respective computation steps over client and server. Our preliminary user study shows that ResEval Mash indeed has the power to enable domain experts to develop own mashups (research evaluation metrics); other mashup platforms rather support skilled developers. The reason for this success is ResEval Mash's domain specificity.","href":"publicationdetails.php?publication_oid=96","where":"WWW 2012 Companion, April 2012, Pages 361-364. Demo."},{"oid":"95","author":"S. Roy Chowdhury, C. Rodríguez, F. Daniel and F. Casati","title":"Baya: Assisted Mashup Development as a Service","to_uploadresource":"91","abstract":"In this demonstration, we describe Baya, an extension of Yahoo! Pipes that guides and speeds up development by interactively recommending composition knowledge harvested from a repository of existing pipes. Composition knowledge is delivered in the form of reusable mashup patterns, which are retrieved and ranked on the fly while the developer models his own pipe (the mashup) and that are automatically weaved into his pipe model upon selection. Baya mines candidate patterns from pipe models available online and thereby leverages on the knowledge of the crowd, i.e., of other developers. Baya is an extension for the Firefox browser that seamlessly integrates with Pipes. It enhances Pipes with a powerful new feature for both expert developers and beginners, speeding up the former and enabling the latter. The discovery of composition knowledge is provided as a service and can easily be extended toward other modeling environments.","href":"publicationdetails.php?publication_oid=95","where":"WWW 2012 Companion, April 2012, Pages 409-412. Demo."},{"oid":"100","author":"O. Chudnovskyy, T. Nestler, M. Gaedke, F. Daniel, J. I. Fernández-Villamor, V. Chepegin, J. A. Fornas, S.Wilson, C. Kögler and H. Chang","title":"End-User-Oriented Telco Mashups: The OMELETTE Approach","to_uploadresource":"95","abstract":"With the success of Web 2.0 we are witnessing a growing number of services and APIs exposed by Telecom, IT and content providers. Targeting the Web community and, in particular, Web application developers, service providers expose capabilities of their infrastructures and applications in order to open new markets and to reach new customer groups. However, due to the complexity of the underlying technologies, the last step, i.e., the consumption and integration of the offered services, is a non-trivial and time-consuming task that is still a prerogative of expert developers. Although many approaches to lower the entry barriers for end users exist, little success has been achieved so far. In this paper, we introduce the OMELETTE project and show how it addresses end-user-oriented telco mashup development. We present the goals of the project, describe its contributions, summarize current results, and describe current and future work.","href":"publicationdetails.php?publication_oid=100","where":"WWW 2012 Companion, April 2012, Pages 235-238."},{"oid":"103","author":"J.-N. Mazón, I. Garrigós, F. Daniel and J. Trujillo","title":"Introduction to the special issue of Business Intelligence and the Web","abstract":null,"to_uploadresource":null,"where":"Decision Support Systems, Volume 52, Number 4, 2012, Pages 851-852. Special issue editorial."},{"oid":"93","author":"F. Casati, F. Daniel, G. Dantchev, J. Eriksson, N. Finne, S. Karnouskos, P. Moreno Montero, L. Mottola, F.J. Oppermann, G. P. Picco, A. Quartulli, K. Römer, P. Spiess, S. Tranquillini and T. Voigt","title":"From Business Process Specifications to Sensor Network Deployments","to_uploadresource":"89","abstract":"The industrial adoption of wireless sensor networks (WSNs) is hampered by two main factors. First, there is a lack of integration of WSNs with business process back-ends. Second, programming WSNs is still challenging as it is mainly performed at the operating system level. To this end, we provide makeSense - a unified programming framework and a compilation chain that, from high-level business process specifications, generates code ready for deployment on WSN nodes.","href":"publicationdetails.php?publication_oid=93","where":"EWSN 2012, February 2012. Demo."},{"oid":"92","author":"F. Daniel, K. Barkaoui and S. Dustdar (Eds.)","title":"Business Process Management Workshops - BPM 2011 International Workshops Clermont-Ferrand, France, August\/September 2011, Revised Selected Papers","to_uploadresource":null,"abstract":"LNBIP 99 and LNBIP 100 together constitute the thoroughly refereed post-proceedings of twelve international workshops held in Clermont-Ferrand, France in conjunction with the 9th International Conference on Business Process Management, BPM 2011, in August 2011.\r\n\r\nThe twelve workshops focused on Business Process Design (BPD 2011), Business Process Intelligence (BPI 2011), Business Process Management and Social Software (BPMS2 2011), Cross-Enterprise Collaboration (CEC 2011), Empirical Research in Business Process Management (ER-BPM 2011), Event-Driven Business Process Management (edBPM 2011), Process Model Collections (PMC 2011), Process-Aware Logistics SSystems (PALS 2011), Process-Oriented Aystems in Healthcare (ProHealth 2011), Reuse in Business Process Management (rBPM 2011), Traceability and Compliance of Semi-Structured Processes (TC4SP 2011), and Workflow Security Audit and Certification (WfSAC 2011). In addition, the proceedings also include the Process Mining Manifesto (as an Open Access Paper), which has been jointly developed by more than 70 scientists, consultants, software vendors, and end-users.","where":"Springer, 2012. Part II, LNBIP 100, ISBN 978-3-642-28114-3"},{"oid":"98","author":"F. Daniel, K. Barkaoui and S. Dustdar (Eds.)","title":"Business Process Management Workshops - BPM 2011 International Workshops Clermont-Ferrand, France, August\/September 2011, Revised Selected Papers","to_uploadresource":null,"abstract":"LNBIP 99 and LNBIP 100 together constitute the thoroughly refereed post-proceedings of twelve international workshops held in Clermont-Ferrand, France in conjunction with the 9th International Conference on Business Process Management, BPM 2011, in August 2011.\r\n\r\nThe twelve workshops focused on Business Process Design (BPD 2011), Business Process Intelligence (BPI 2011), Business Process Management and Social Software (BPMS2 2011), Cross-Enterprise Collaboration (CEC 2011), Empirical Research in Business Process Management (ER-BPM 2011), Event-Driven Business Process Management (edBPM 2011), Process Model Collections (PMC 2011), Process-Aware Logistics SSystems (PALS 2011), Process-Oriented Aystems in Healthcare (ProHealth 2011), Reuse in Business Process Management (rBPM 2011), Traceability and Compliance of Semi-Structured Processes (TC4SP 2011), and Workflow Security Audit and Certification (WfSAC 2011). In addition, the proceedings also include the Process Mining Manifesto (as an Open Access Paper), which has been jointly developed by more than 70 scientists, consultants, software vendors, and end-users.","where":"Springer, 2012. Part I, LNBIP 99, ISBN 978-3-642-28107-5"}]